'use strict';

window.mock = (function () {
  return {
    offerTitles: [
      'Маленькая квартирка рядом с парком',
      'Небольшая лавочка в парке',
      'Императорский дворец в центре Токио',
      'Милейший чердачок',
      'Наркоманский притон',
      'Чёткая хата',
      'Стандартная квартира в центре',
      'Тихая квартирка недалеко от метро'
    ],
    prices: [
      5000,
      15000,
      10000,
      25000,
      12000,
      30000,
      18000,
      50000
    ],
    bookingTypes: [
      'palace',
      'flat',
      'house',
      'bungalo'
    ],
    checks: [
      '12:00',
      '13:00',
      '14:00'
    ],
    features: [
      'wifi',
      'dishwasher',
      'parking',
      'washer',
      'elevator',
      'conditioner'
    ],
    descriptions: [
      'Квартира на первом этаже. Соседи тихие. Для всех, кто терпеть не может шума и суеты.',
      'Великолепный таун-хауз в центре Токио. Подходит как туристам, так и бизнесменам. Дом полностью укомплектован и имеет свежий ремонт.',
      'Маленькая чистая квратира на краю парка. Без интернета, регистрации и СМС.',
      'Великолепная лавочка прямо в центре парка. Подходит для всех кто любит спать на свежем воздухе.',
      'Маленькая квартирка на чердаке. Для самых не требовательных.',
      'Замечательный дворец в старинном центре города. Только для тех кто может себе позволить дворец. Лакеев и прочих жокеев просим не беспокоить.',
      'У нас есть всё! Шприцы, интернет, кофе. Для всех кто знает толк в отдыхе. Полицию просим не беспокоить.',
      'Тут красиво, светло и уютно. Есть где разместиться компании из 5 человек. Кофе и печеньки бесплатно.'
    ],
    photos: [
      'http://o0.github.io/assets/images/tokyo/hotel1.jpg',
      'http://o0.github.io/assets/images/tokyo/hotel2.jpg',
      'http://o0.github.io/assets/images/tokyo/hotel3.jpg'
    ]
  };
})();
